# Pandas :
## Learn basics of pandas 
## Read CSV files with pandas
## Learn the DataFrame
## Datetime and GroupBy
## how to export to excel 
## Create a chart :

In [1]:
import pandas as pd

In [2]:
d = {"Cars": ["porshe","porshe","ferrari","ferrari"],
     "Speed ":[200,220,300,350]
    }

In [3]:
df = pd.DataFrame(d)
df

      Cars  Speed
0   porshe     200
1   porshe     220
2  ferrari     300
3  ferrari     350

In [4]:
df.mean()

C:\Users\pavan\AppData\Local\Temp\ipykernel_3124\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Speed     267.5
dtype: float64

In [5]:
df[df["Cars"] == 'porshe']

     Cars  Speed
0  porshe     200
1  porshe     220

In [6]:
df.groupby("Cars").sum()

         Speed
Cars
ferrari     650
porshe      420

In [7]:
speed_check = pd.read_csv("data/speed_check.csv",delimiter=";",parse_dates=True,index_col="Date")

speed_check

                Car  Speed
Date
2021-03-15  Porsche    315
2021-03-30      BMW    250
2021-04-02  Ferrari    295
2021-04-10      BMW    180
2021-04-15  Porsche    210
2021-04-20  Ferrari    230
2021-04-23      BMW    175
2021-04-30      BMW    205

In [8]:
speed_check.index

DatetimeIndex(['2021-03-15', '2021-03-30', '2021-04-02', '2021-04-10',
               '2021-04-15', '2021-04-20', '2021-04-23', '2021-04-30'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [9]:
speed_check.dtypes

Car      object
Speed     int64
dtype: object

In [10]:
speed_check.groupby("Car").mean()

         Speed
Car
BMW      202.5
Ferrari  262.5
Porsche  262.5

In [11]:

monthly = speed_check.groupby(pd.Grouper(freq='M')).mean()

C:\Users\pavan\AppData\Local\Temp\ipykernel_3124\3133273940.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  monthly = speed_check.groupby(pd.Grouper(freq='M')).mean()

In [12]:
monthly.index = monthly.index.month_name()

In [13]:
monthly

            Speed
Date
March  282.500000
April  215.833333

In [14]:
speed_check.to_excel("speed1.xlsx")

In [15]:
workbook  = pd.ExcelWriter("speed1.xlsx")
speed_check.groupby("Car").mean().to_excel(workbook,sheet_name="cars")
monthly.to_excel(workbook,sheet_name="monthly")
workbook.close()

In [16]:
workbook  = pd.ExcelWriter("speed1.xlsx")
speed_check.groupby("Car").mean().to_excel(workbook,sheet_name="cars")
monthly.to_excel(workbook,sheet_name="monthly")



workbook.close()